In [1]:
f<-array(1:24, c(3,3,2))
dimnames(f)<-list(c("1", "2", "3"), c("A", "B", "C"), c("ARR1", "ARR2"))
dimnames(f)<-list(paste("ROW", c(1:3)),paste("COL",c(1:3)),paste("ARR",c(1:2)))

In [3]:
a<-list("top", c(2,4,6), c(T,F,T))
a

[[1]]
[1] "top"

[[2]]
[1] 2 4 6

[[3]]
[1]  TRUE FALSE  TRUE

# 데이터프레임

In [5]:
name<-c("KIM", "LEE", "HAN", "SHIN", "PARK")
gender<-as.factor(c("M", "F", "M", "M", "F"))
math<-c(100, 80, 75, 95, 65)
english<-c(80, 100, 60, 70, 80)
korean<-c(50, 70, 80, 100, 100)
attend<-c(T, F, T, T, F)
a<-data.frame(name, gender, math, english, korean, attend, stringsAsFactors=T)
a

  name gender math english korean attend
1 KIM  M      100   80      50     TRUE
2 LEE  F       80  100      70    FALSE
3 HAN  M       75   60      80     TRUE
4 SHIN M       95   70     100     TRUE
5 PARK F       65   80     100    FALSE

In [10]:
name<-c("JANG", "JEONG")
gender<-as.factor(c("M", "F"))
math<-c(100, 80)
english<-c(80, 100)
korean<-c(50, 70)
attend<-c(T, F)
b<-data.frame(name, gender, math, english, korean, attend,stringsAsFactors=T)
b

  name  gender math english korean attend
1 JANG  M      100   80     50      TRUE
2 JEONG F       80  100     70     FALSE

In [11]:
c<-rbind(a, b) # 행끼리 합치기

In [12]:
c

  name  gender math english korean attend
1 KIM   M      100   80      50     TRUE
2 LEE   F       80  100      70    FALSE
3 HAN   M       75   60      80     TRUE
4 SHIN  M       95   70     100     TRUE
5 PARK  F       65   80     100    FALSE
6 JANG  M      100   80      50     TRUE
7 JEONG F       80  100      70    FALSE

In [13]:

social<-c(100, 80, 50, 65, 70)
science<-c(80, 55, 75, 60, 100)
d<-cbind(a, social, science) # 열끼리 합치기
d

  name gender math english korean attend social science
1 KIM  M      100   80      50     TRUE  100     80
2 LEE  F       80  100      70    FALSE   80     55
3 HAN  M       75   60      80     TRUE   50     75
4 SHIN M       95   70     100     TRUE   65     60
5 PARK F       65   80     100    FALSE   70    100

In [15]:
e<-transform(a, social=c(100, 80, 50, 65, 70), science=c(80, 55, 75, 60, 100))
e # 열끼리 데이터프레임 합치기

  name gender math english korean attend social science
1 KIM  M      100   80      50     TRUE  100     80
2 LEE  F       80  100      70    FALSE   80     55
3 HAN  M       75   60      80     TRUE   50     75
4 SHIN M       95   70     100     TRUE   65     60
5 PARK F       65   80     100    FALSE   70    100

# merge으로 데이터프레임 합치기

In [16]:
name<-c("LEE", "KIM", "HAN", "SHIN", "PARK")
japanese<-c(100, 60, 70, 20, 50)
f<-data.frame(name, japanese)
g<-merge(a, f, key="name")

In [33]:
g

  name gender math english korean attend japanese
1 HAN  M       75   60      80     TRUE   70
2 KIM  M      100   80      50     TRUE   60
3 LEE  F       80  100      70    FALSE  100
4 PARK F       65   80     100    FALSE   50
5 SHIN M       95   70     100     TRUE   20

# 데이터프레임 특정 열 찾기

In [19]:
g[,1:2]

  name gender
1 HAN  M
2 KIM  M
3 LEE  F
4 PARK F
5 SHIN M

In [20]:
g[2:3,]

  name gender math english korean attend japanese
2 KIM  M      100   80     50      TRUE   60
3 LEE  F       80  100     70     FALSE  100

In [21]:
g[1:3,2:3]

  gender math
1 M       75
2 M      100
3 F       80

In [22]:
g[-1] #첫번째 열만 제외하기

  gender math english korean attend japanese
1 M       75   60      80     TRUE   70
2 M      100   80      50     TRUE   60
3 F       80  100      70    FALSE  100
4 F       65   80     100    FALSE   50
5 M       95   70     100     TRUE   20

In [26]:
g[-1,] #첫번째 행만 제외하기

  name gender math english korean attend japanese
2 KIM  M      100   80      50     TRUE   60
3 LEE  F       80  100      70    FALSE  100
4 PARK F       65   80     100    FALSE   50
5 SHIN M       95   70     100     TRUE   20

In [42]:
g[g$math>=60,] #특정 값 조회

  name gender math english korean attend japanese
1 HAN  M       75   60      80     TRUE   70
2 KIM  M      100   80      50     TRUE   60
3 LEE  F       80  100      70    FALSE  100
4 PARK F       65   80     100    FALSE   50
5 SHIN M       95   70     100     TRUE   20

In [46]:
g[g$name=='KIM',]

  name gender math english korean attend japanese
2 KIM  M      100  80      50     TRUE   60

In [48]:
g[g$math>=80 & g$korean>=80,] # 데이터프레임 AND 으로 조회

  name gender math english korean attend japanese
5 SHIN M      95   70      100    TRUE   20

In [50]:
g[g$math>=90 | g$korean>=80,] # 데이터프레임 OR 으로 조회

  name gender math english korean attend japanese
1 HAN  M       75  60       80     TRUE  70
2 KIM  M      100  80       50     TRUE  60
4 PARK F       65  80      100    FALSE  50
5 SHIN M       95  70      100     TRUE  20

In [51]:
# 데이터프레임 특정 행 검색, AND 및 OR 조회
h<-subset(g, select=c(name, math, korean),subset=(math>=50 & korean>=70))
h

  name math korean
1 HAN  75    80
3 LEE  80    70
4 PARK 65   100
5 SHIN 95   100

In [53]:
#컬럼 위치 변경, 행 위치 변경
g<-g[,c(1, 2, 6, 5, 3, 4)]
g

  name gender english math attend korean
1 HAN  M       60      75   TRUE   80
2 KIM  M       80     100   TRUE   50
3 LEE  F      100      80  FALSE   70
4 PARK F       80      65  FALSE  100
5 SHIN M       70      95   TRUE  100